
var Rxports = {
	errorTexts : {
		timeout: '请求超时, 请重试',
		/*error: '您访问的次数过多,请稍后再试',*/
		error: '网络断开，请稍后再试',
		abort: '请求被取消, 稍后重试',
		parsererror: '无法解析服务器返回的数据',
		A00007: '该用户已经登录',
		A00099: '为保证您的网络安全,请稍后再试',
		A10001: '同时登录此帐号的用户过多',
		A10002: '同时登录此帐号的用户过多',
		P00102: '您输入的邮箱格式不正确',
		P00103: '您输入的手机号不正确',
		P00104: '设置的密码太简单了',
		P00105: '该邮箱已被注册',
		P00106: '该手机号已被注册',
		// P00107: '错误的验证码',
		P00108: '此用户不存在',
		P00111: '该用户还未被激活',
		P00112: '该邮箱还未注册',
		P00117: '帐号或密码错误',
		P00118: '该帐号已激活',
		// P00141: '您访问的次数过多,请稍后再试',
		P00142: '您设置的密码过于简单',
		P00143: '该帐号已被封',
		P00302: '此邮箱已经被占用,请直接绑定已有帐号或使用其他邮箱',
		P00303: '绑定失败',
		P00306: '该帐号尚未激活,无法完成绑定',
		P00402: '此用户不存在',
		P00404: '该手机号已被注册',
		P00405: '请输入正确的验证码',
		P00406: '帐号密码错误',
		P00407: '设置的密码太简单了',
		P00410: '两次获取邀请码时间间隔不得小于30s',
		P00411: '您获取验证码次数过多',
		P00412: '生成验证码失败',
		P00413: '发送验证码失败',
		P00414: '该手机号还未注册',
		P00415: '您获取验证码次数过多',
		P00501: '登录超时,请重试',
		P00141: '操作过于频繁，请稍后再试'
	},

}	

module.exports = Rxports



















































